Create a DataFrame, save it as a Csv File, set one of the column as index

In [16]:
import pandas as pd
import numpy as np
names = ["Joey","Chandler","Ross","Monica","Rachel","Phoebe"]
room_Numbers = np.random.randint(low = 100,high = 200,size = 6)
age = np.random.randint(low=25,high=50,size=6)
idNumber= np.random.randint(low=1,high=10,size=6)
dict1 = {
    'Name':names,
    'Room number':room_Numbers,
    'Age':age,
    'ID_Number' : idNumber
}

df = pd.DataFrame(dict1)
df

       Name  Room number  Age  ID_Number
0      Joey          122   45          7
1  Chandler          112   41          1
2      Ross          109   36          1
3    Monica          143   26          3
4    Rachel          145   30          2
5    Phoebe          160   40          2

In [17]:
df.to_csv("MyFriends")

In [19]:
df.set_index('ID_Number',inplace=True)
df

               Name  Room number  Age
ID_Number
7              Joey          122   45
1          Chandler          112   41
1              Ross          109   36
3            Monica          143   26
2            Rachel          145   30
2            Phoebe          160   40